### Assignment 1: Creating and Connecting to a Database

1. Write a Python function to create a new SQLite3 database named `test.db`.
2. Write a Python function to create a table named `employees` with columns `id` (integer), `name` (text), `age` (integer), and `department` (text) in the `test.db` database.

In [1]:
import sqlite3

In [6]:
connection=sqlite3.connect('test.db')
connection
cursor=connection.cursor()

In [8]:
cursor.execute('''
CREATE TABLE employees(id Integer Primary Key , name Text, age Integer, department TExt)
''')

### Assignment 2: Inserting Data

1. Write a Python function to insert a new employee into the `employees` table.
2. Insert at least 5 different employees into the `employees` table.

In [13]:
cursor.execute('''
INSERT INTO employees(id,name,age,department) Values (14,'amarjeet',23,'cse')
''')
connection.commit()

In [15]:
cursor.execute('''
INSERT INTO employees(id,name,age,department) Values (1,'aksh',23,'cse')
''')
cursor.execute('''
INSERT INTO employees(id,name,age,department) Values (2,'chandra',23,'cse')
''')
cursor.execute('''
INSERT INTO employees(id,name,age,department) Values (3,'ajeet',23,'cse')
''')
cursor.execute('''
INSERT INTO employees(id,name,age,department) Values (4,'kumar',23,'cse')
''')

In [16]:
connection.commit()

### Assignment 3: Querying Data

1. Write a Python function to fetch and display all records from the `employees` table.
2. Write a Python function to fetch and display all employees from a specific department.

In [19]:
cursor.execute('SELECT * from employees')
rows=cursor.fetchall()
print(type(rows))
for line in rows:
    print(line)

<class 'list'>
(1, 'aksh', 23, 'cse')
(2, 'chandra', 23, 'cse')
(3, 'ajeet', 23, 'cse')
(4, 'kumar', 23, 'cse')
(12, 'amarjeet', 23, 'cse')
(13, 'amarjeet', 23, 'cse')
(14, 'amarjeet', 23, 'cse')

In [20]:
cursor.execute('SELECT * from employees where department="cse"')
rows=cursor.fetchall()
print(type(rows))
for line in rows:
    print(line)

<class 'list'>
(1, 'aksh', 23, 'cse')
(2, 'chandra', 23, 'cse')
(3, 'ajeet', 23, 'cse')
(4, 'kumar', 23, 'cse')
(12, 'amarjeet', 23, 'cse')
(13, 'amarjeet', 23, 'cse')
(14, 'amarjeet', 23, 'cse')

### Assignment 4: Updating Data

1. Write a Python function to update the department of an employee based on their `id`.
2. Update the department of at least 2 employees and display the updated records.

In [22]:
cursor.execute('''
UPDATE employees Set department='me'  where id=1
''')
connection.commit()

# 2. Update the department of at least 2 employees and display the updated records.
cursor.execute('''
UPDATE employees Set department='mce'  where name='amarjeet'
''')
cursor.execute('''
UPDATE employees Set department='eee'  where name='kumar'
''')
connection.commit()

### Assignment 5: Deleting Data

1. Write a Python function to delete an employee from the `employees` table based on their `id`.
2. Delete at least 1 employee and display the remaining records.

In [ ]:
cursor.execute('''
DELETE from employees where id=13
''')
cursor.execute('''
SELECT * from employees
''')
connection.commit()
rows=cursor.fetchall()
for line in rows:
    print(line)

<class 'list'> [(1, 'aksh', 32, 'me'), (2, 'chandra', 23, 'cse'), (3, 'ajeet', 23, 'cse'), (4, 'kumar', 23, 'eee'), (12, 'amarjeet', 23, 'mce'), (14, 'amarjeet', 23, 'mce')]
(1, 'aksh', 32, 'me')
(2, 'chandra', 23, 'cse')
(3, 'ajeet', 23, 'cse')
(4, 'kumar', 23, 'eee')
(12, 'amarjeet', 23, 'mce')
(14, 'amarjeet', 23, 'mce')

### Assignment 6: Advanced Queries

1. Write a Python function to fetch and display employees older than a certain age.
2. Write a Python function to fetch and display employees whose names start with a specific letter.

In [ ]:
cursor.execute('''
SELECT * from employees where age>20 and age<30
''')

rows=cursor.fetchall()
for line in rows:
    print(line)
connection.commit()

(2, 'chandra', 23, 'cse')
(3, 'ajeet', 23, 'cse')
(4, 'kumar', 23, 'eee')
(12, 'amarjeet', 23, 'mce')
(14, 'amarjeet', 23, 'mce')

In [35]:
cursor.execute('''
SELECT * FROM employees WHERE name LIKE ?
''', ('a' + '%',))
rows=cursor.fetchall()
for line in rows:
    print(line)
connection.commit()

(1, 'aksh', 32, 'me')
(3, 'ajeet', 23, 'cse')
(12, 'amarjeet', 23, 'mce')
(14, 'amarjeet', 23, 'mce')

### Assignment 7: Handling Transactions

1. Write a Python function to insert multiple employees into the `employees` table in a single transaction. Ensure that if any insertion fails, none of the insertions are committed.
2. Write a Python function to update the age of multiple employees in a single transaction. Ensure that if any update fails, none of the updates are committed.

In [ ]:
employee_data=[
    (233,'john',35,'cse'),
    (235,'ram',35,'cse'),
    (237,'sweety',35,'me'),
    (239,'kumar',35,'ce'),
    (240,'laxman',35,'xe'),
    (243,'wicx',35,'me'),
]
cursor.executemany(''' INSERT INTO employees(id,name,age,department) VALUES (?,?,?,?)''',employee_data)

IntegrityError: UNIQUE constraint failed: employees.id

In [42]:
cursor.execute('Select * from employees ')
rows=cursor.fetchall()
for line in rows:
    print(line)
connection.commit()

(1, 'aksh', 32, 'me')
(2, 'chandra', 23, 'cse')
(3, 'ajeet', 23, 'cse')
(4, 'kumar', 23, 'eee')
(12, 'amarjeet', 23, 'mce')
(14, 'amarjeet', 23, 'mce')
(233, 'john', 35, 'cse')
(235, 'ram', 35, 'cse')
(237, 'sweety', 35, 'me')
(239, 'kumar', 35, 'ce')
(240, 'laxman', 35, 'xe')
(243, 'wicx', 35, 'me')

In [45]:
def update_employee_age(updates):
    try:
        for old_age,new_age in updates:
            cursor.execute('''
        UPDATE employees SET age=? where age=?
    ''',(new_age,old_age))
        connection.commit()
        print("All updates committed successfully.")
    except Exception as e:
        connection.rollback()
        print("Transaction failed. Rolled back changes. Error:", e)

updates=[[23,32]]
update_employee_age(updates)
cursor.execute('Select * from employees ')
rows=cursor.fetchall()
for line in rows:
    print(line)
connection.commit()

All updates committed successfully.
(1, 'aksh', 32, 'me')
(2, 'chandra', 32, 'cse')
(3, 'ajeet', 32, 'cse')
(4, 'kumar', 32, 'eee')
(12, 'amarjeet', 32, 'mce')
(14, 'amarjeet', 32, 'mce')
(233, 'john', 35, 'cse')
(235, 'ram', 35, 'cse')
(237, 'sweety', 35, 'me')
(239, 'kumar', 35, 'ce')
(240, 'laxman', 35, 'xe')
(243, 'wicx', 35, 'me')

### Assignment 8: Creating Relationships

1. Create a new table named `departments` with columns `id` (integer) and `name` (text).
2. Modify the `employees` table to include a foreign key referencing the `id` column in the `departments` table.
3. Write a Python function to insert data into both the `departments` and `employees` tables, ensuring referential integrity.

In [ ]:
cursor.execute('''
CREATE TABLE employees(id Integer,name Text,age Integer,department Text)
               
''')
data=[
    (1, 'aksh', 32, 'me'),
(2, 'chandra', 23, 'cse'),
(3, 'ajeet', 23, 'cse'),
(4, 'kumar', 23, 'eee'),
(12, 'amarjeet', 23, 'mce'),
(14, 'amarjeet', 23, 'mce'),
(233, 'john', 35, 'cse'),
(235, 'ram', 35, 'cse'),
(237, 'sweety', 35, 'me'),
(239, 'kumar', 35, 'ce'),
(240, 'laxman', 35, 'xe'),
(243, 'wicx', 35, 'me')
]
cursor.executemany('''
INSERT INTO employees(id,name,age,department) VALUES (?,?,?,?)
''',data)

In [ ]:
cursor.execute('''
CREATE TABLE departments(id Integer,name Text)
               
''')

In [70]:

cursor.execute('''
CREATE TABLE employeed_new(id Integer,name Text,age Integer,department TEXT,dept_id Integer,FOREIGN KEY (dept_id) REFERENCES departments(id))
''')

OperationalError: table employeed_new already exists

In [73]:
cursor.execute('''
INSERT INTO employeed_new(id,name,age,department) SELECT id,name,age,department from employees  
                
''')
cursor.execute('''
SELECT * from employeed_new
''')
rows=cursor.fetchall()
for row in rows:
    print(row)
connection.commit()

(1, 'aksh', 32, 'me', None)
(2, 'chandra', 23, 'cse', None)
(3, 'ajeet', 23, 'cse', None)
(4, 'kumar', 23, 'eee', None)
(12, 'amarjeet', 23, 'mce', None)
(14, 'amarjeet', 23, 'mce', None)
(233, 'john', 35, 'cse', None)
(235, 'ram', 35, 'cse', None)
(237, 'sweety', 35, 'me', None)
(239, 'kumar', 35, 'ce', None)
(240, 'laxman', 35, 'xe', None)
(243, 'wicx', 35, 'me', None)

In [74]:
cursor.execute("DROP TABLE employees")
cursor.execute("ALTER TABLE employeed_new RENAME TO employees ")

In [75]:
connection.commit()

In [80]:
cursor.execute("INSERT INTO departments VALUES (1, 'Engineering')")
cursor.execute("INSERT INTO employees VALUES (101, 'Alice',34,'cse', 1); ")
cursor.execute("INSERT INTO employees VALUES (101, 'Alice',34,'cse', 34); ")
connection.commit()

In [87]:
import time;
currTime=time.time()
cursor.execute("SELECT * from employees WHERE name LIKE ? ",('a' + '%',))
rows=cursor.fetchall()
for row in rows:
    print(row)
print('total time without indexing ',time.time()-currTime)

(1, 'aksh', 32, 'me', None)
(3, 'ajeet', 23, 'cse', None)
(12, 'amarjeet', 23, 'mce', None)
(14, 'amarjeet', 23, 'mce', None)
(101, 'Alice', 34, 'cse', 1)
(101, 'Alice', 34, 'cse', 1)
(101, 'Alice', 34, 'cse', 34)
(101, 'Alice', 34, 'cse', 1)
(101, 'Alice', 34, 'cse', 34)
(101, 'Alice', 34, 'cse', 1)
(101, 'Alice', 34, 'cse', 34)
total time without indexing  0.002000570297241211

In [81]:
cursor.execute('''
CREATE INDEX  name_idx ON employees(name)
''')

In [82]:
def fetchDetails(letter):
    cursor.execute("SELECT * from employees WHERE name LIKE ? ",(letter + '%',))
    rows=cursor.fetchall()
    for row in rows:
        print(row)
fetchDetails('a')

(1, 'aksh', 32, 'me', None)
(3, 'ajeet', 23, 'cse', None)
(12, 'amarjeet', 23, 'mce', None)
(14, 'amarjeet', 23, 'mce', None)
(101, 'Alice', 34, 'cse', 1)
(101, 'Alice', 34, 'cse', 1)
(101, 'Alice', 34, 'cse', 34)
(101, 'Alice', 34, 'cse', 1)
(101, 'Alice', 34, 'cse', 34)
(101, 'Alice', 34, 'cse', 1)
(101, 'Alice', 34, 'cse', 34)

In [83]:
import time;

In [86]:
currTime=time.time()
fetchDetails('a')
totalTime=time.time()-currTime
print(totalTime , ' -->total time taken with indexing')

(1, 'aksh', 32, 'me', None)
(3, 'ajeet', 23, 'cse', None)
(12, 'amarjeet', 23, 'mce', None)
(14, 'amarjeet', 23, 'mce', None)
(101, 'Alice', 34, 'cse', 1)
(101, 'Alice', 34, 'cse', 1)
(101, 'Alice', 34, 'cse', 34)
(101, 'Alice', 34, 'cse', 1)
(101, 'Alice', 34, 'cse', 34)
(101, 'Alice', 34, 'cse', 1)
(101, 'Alice', 34, 'cse', 34)
0.0009984970092773438  -->total time taken with indexing

In [88]:
connection.commit()

### Assignment 10: Backing Up and Restoring Data

1. Write a Python function to back up the `test.db` database to a file named `backup.db`.
2. Write a Python function to restore the `test.db` database from the `backup.db` file.

In [3]:
import sqlite3

def backup_database(sourcedb,destdb):
    source_connection=sqlite3.connect(sourcedb)
    dest_connection=sqlite3.connect(destdb)
    with dest_connection:
        source_connection.backup(dest_connection)
    print(f'backup completed from {sourcedb}->{destdb}')
    source_connection.close()
    dest_connection.close()
def restore_database(backup,source):
    backup_conn=sqlite3.connect(backup)
    source_conn=sqlite3.connect(source)
    with source_conn:
        backup_conn.backup(source_conn)
    print(f'restore completed from {backup} -> {source}')
    backup_conn.close()
    source_conn.close()

backup_database('test.db','backup.db')

backup completed from test.db->backup.db